In [1]:
import pandas as pd
import numpy as np

In [2]:
#loading the dataset
df = pd.read_excel("C:\\Users\\14375\\Downloads\\sql project data\\sales fact table.xlsx")

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119 entries, 0 to 118
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction id    113 non-null    object
 1   transaction id.1  113 non-null    object
 2   AC                113 non-null    object
 3   Unnamed: 3        0 non-null      float64
 4   AA                113 non-null    object
 5   AE                113 non-null    object
 6   Unnamed: 6        0 non-null      float64
 7   C                 113 non-null    object
 8   CI                113 non-null    object
 9   Date              113 non-null    datetime64[ns]
 10  Payment Method    113 non-null    object
dtypes: datetime64[ns](1), float64(2), object(8)
memory usage: 10.4+ KB

In [4]:
df.describe()

       Unnamed: 3  Unnamed: 6
count         0.0         0.0
mean          NaN         NaN
std           NaN         NaN
min           NaN         NaN
25%           NaN         NaN
50%           NaN         NaN
75%           NaN         NaN
max           NaN         NaN

In [5]:
df.shape

(119, 11)

In [6]:
df.head(5)

,transaction id,transaction id.1,AC,Unnamed: 3,AA,AE,Unnamed: 6,C,CI,Date,Payment Method
0,T001,T001,AC077,NaN,AA037,AE096,NaN,C096,CI019,2022-01-01,Debit Card
1,T002,T002,AC032,NaN,AA032,AE032,NaN,C032,CI038,2022-01-02,Credit Card
2,T003,T003,AC058,NaN,AA034,AE101,NaN,C085,CI070,2022-01-03,Cash
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT,NaN
4,T004,T004,AC119,NaN,AA036,AE064,NaN,C056,CI018,2022-01-04,Net Banking

In [7]:
df.dropna(how='all', inplace=True)

In [8]:
df.dropna(axis=1, how='all', inplace=True)

In [9]:
df = df.drop('transaction id.1', axis=1)

In [10]:
df.columns

Index(['transaction id', 'AC', 'AA', 'AE', 'C', 'CI    ', 'Date',
       'Payment Method'],
      dtype='object')

In [18]:
df = df.rename(columns={'AC': 'Air Conditioner id', 'AA': 'Appliance id', 'C': 'Camera id', 'CI    ' : 'Customer id', 'AE': 'Electronic id'})

In [19]:
print(df)

    transaction id Air Conditioner id Appliance id Electronic id Camera id  \
0             T001              AC077        AA037         AE096      C096
1             T002              AC032        AA032         AE032      C032
2             T003              AC058        AA034         AE101      C085
4             T004              AC119        AA036         AE064      C056
5             T005              AC001        AA051         AE074      C013
..             ...                ...          ...           ...       ...
114           T109              AC048        AA063         AE096      C017
115           T110              AC025        AA012         AE070      C081
116           T111              AC117        AA097         AE112      C144
117           T112              AC036        AA011         AE048      C074
118           T113              AC020        AA069         AE110      C071

    Customer id       Date Payment Method
0         CI019 2022-01-01     Debit Card
1         CI038 2022-01-02    Credit Card
2         CI070 2022-01-03           Cash
4         CI018 2022-01-04    Net Banking
5         CI059 2022-01-05            UPI
..          ...        ...            ...
114       CI058 2022-04-19    Credit Card
115       CI050 2022-04-20            UPI
116       CI053 2022-04-21           Cash
117       CI019 2022-04-22     Debit Card
118       CI012 2022-04-23    Net Banking

[113 rows x 8 columns]

In [20]:
print(df)

    transaction id Air Conditioner id Appliance id Electronic id Camera id  \
0             T001              AC077        AA037         AE096      C096
1             T002              AC032        AA032         AE032      C032
2             T003              AC058        AA034         AE101      C085
4             T004              AC119        AA036         AE064      C056
5             T005              AC001        AA051         AE074      C013
..             ...                ...          ...           ...       ...
114           T109              AC048        AA063         AE096      C017
115           T110              AC025        AA012         AE070      C081
116           T111              AC117        AA097         AE112      C144
117           T112              AC036        AA011         AE048      C074
118           T113              AC020        AA069         AE110      C071

    Customer id       Date Payment Method
0         CI019 2022-01-01     Debit Card
1         CI038 2022-01-02    Credit Card
2         CI070 2022-01-03           Cash
4         CI018 2022-01-04    Net Banking
5         CI059 2022-01-05            UPI
..          ...        ...            ...
114       CI058 2022-04-19    Credit Card
115       CI050 2022-04-20            UPI
116       CI053 2022-04-21           Cash
117       CI019 2022-04-22     Debit Card
118       CI012 2022-04-23    Net Banking

[113 rows x 8 columns]

In [21]:
print(df.isnull().sum())

transaction id        0
Air Conditioner id    0
Appliance id          0
Electronic id         0
Camera id             0
Customer id           0
Date                  0
Payment Method        0
dtype: int64

In [22]:
print(df)

    transaction id Air Conditioner id Appliance id Electronic id Camera id  \
0             T001              AC077        AA037         AE096      C096
1             T002              AC032        AA032         AE032      C032
2             T003              AC058        AA034         AE101      C085
4             T004              AC119        AA036         AE064      C056
5             T005              AC001        AA051         AE074      C013
..             ...                ...          ...           ...       ...
114           T109              AC048        AA063         AE096      C017
115           T110              AC025        AA012         AE070      C081
116           T111              AC117        AA097         AE112      C144
117           T112              AC036        AA011         AE048      C074
118           T113              AC020        AA069         AE110      C071

    Customer id       Date Payment Method
0         CI019 2022-01-01     Debit Card
1         CI038 2022-01-02    Credit Card
2         CI070 2022-01-03           Cash
4         CI018 2022-01-04    Net Banking
5         CI059 2022-01-05            UPI
..          ...        ...            ...
114       CI058 2022-04-19    Credit Card
115       CI050 2022-04-20            UPI
116       CI053 2022-04-21           Cash
117       CI019 2022-04-22     Debit Card
118       CI012 2022-04-23    Net Banking

[113 rows x 8 columns]

In [24]:
df.to_excel("C:\\Users\\14375\\Downloads\\sql project data\\sales_fact2_clean.xlsx", index=False)